package les16;

//import com.sun.tools.javac.parser.Scanner;

public class Start {
    public static void main(String[] args) {
        // создаем новую игру
//        SapperGame sapperGame = new SapperGame();
//
////        System.out.println();
//        out.println("Выбери уровень сложности");
//        out.println("1- Высокий");
//        out.println("2- Медиум");
//        out.println("3- Низкий");
//        Scanner scanner =new Scanner(System.in);
//       int level= scanner.nextInt();
//
//       //нужен метод для раскладки бомб. в зависимости от уровня сложности
//    sapperGame.bombsByLevel(level);
//    // расставить цифры вокруг бомб для пользователы
//        sapperGame.placeHelpNumberOnMap();
////Вывести карту в консоль
//        sapperGame.printMapGame();
//
//        //цикл игры
//
//        int check = 1;
//        while (check >=1){// 1  и 2 надо спросить снова а -1 конец игры либо бомба либо победил
//            out.println("Выбирите координату х от 1 до 10");
//            int pointX=scanner.nextInt()-1;
//            out.println("Выбирите координату y от 1 до 10");
//            int pointy=scanner.nextInt()-1;
//            //проверка не выхода за границы
//
//            if (pointX>9 || pointy>9|| pointX<0||pointy<0){
//                out.println("Вы вышли за пределы поля!");
//                continue;//повтор while
//            }
//            check=sapperGame.checkPointPlayrs(pointy, pointX);
//            if (check == 2) {
//                out.println("Вы уже вводили данные координаты. введите еще раз");
//            }else if(check==1){
//                sapperGame.printMapGame();
//                out.println("давай следующий ход");
//            }else if (check==-1){
//                sapperGame.printMapGameOver();
//                out.println("бомба! вы проиграли");
//            }else {
//                out.println("поздравляю вы победили!!!!");
//            }
//        }}}
//
//    public void printMapGameOver {
//        for (int i = 0; i < mapGame.length; i++) {
//            for (int j = 0; j < mapGame[i].length; j++) {
//                if (visibbleMapGame[i][j] == 1) {
//                    if (mapGame[i][j] == 0) {
//                        System.out.println("   ");
//                    } else if (mapGame[i][j] == -1) {
//                        System.out.println("бах");
//
//                    } else {
//                        System.out.println(" " + mapGame[i][j] + " ");
//
//                    }
//                } else {
//                    System.out.println(" * ");
//                }
//
//            }
//            System.out.println();
//
        }
    }


